// TODO: Иногда стоит продолжить экспериментировать с упражнением,
// даже когда ты уже во всём разобрался. Если всё работает и ты готов
// к следующему упражнению, введи `n` в терминале.
//
// Файл упражнения перезагружается, когда ты меняешь любую строку ниже!
// Попробуй добавить новый `println!` и посмотри на обновлённый вывод в терминале.

fn main() {
    println!(r#"       Welcome to...                      "#);
    println!(r#"                 _   _ _                  "#);
    println!(r#"  _ __ _   _ ___| |_| (_)_ __   __ _ ___  "#);
    println!(r#" | '__| | | / __| __| | | '_ \ / _` / __| "#);
    println!(r#" | |  | |_| \__ \ |_| | | | | | (_| \__ \ "#);
    println!(r#" |_|   \__,_|___/\__|_|_|_| |_|\__, |___/ "#);
    println!(r#"                               |___/      "#);
    println!();
    println!("Это упражнение успешно компилируется. В остальных упражнениях есть ошибка компилятора");
    println!("или ошибка в логике. Вся идея Rustlings в том, чтобы исправлять эти ошибки и");
    println!("решать упражнения. Удачи!");
    println!();
    println!("Файл этого упражнения: `exercises/rust-basics/00_intro/intro1.rs`. Загляни в него!");
    println!("Путь к текущему упражнению всегда показан под индикатором прогресса.");
    println!("Можно кликнуть по пути, чтобы открыть файл упражнения в редакторе.");
}
