// Компилятору Rust нужно уметь проверять, корректны ли переданные ссылки, чтобы
// сообщить программисту, если ссылка может выйти из области видимости раньше,
// чем будет использована. Помни: ссылки это заимствования, они не владеют
// своими данными. Что, если их владелец выйдет из области видимости?

fn longest<'a>(x: &'a str, y: &'a str) -> &'a str {
    //    ^^^^     ^^          ^^          ^^
    if x.len() > y.len() { x } else { y }
}

fn main() {
    // Здесь можно поэкспериментировать.
}

#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn test_longest() {
        assert_eq!(longest("abcd", "123"), "abcd");
        assert_eq!(longest("abc", "1234"), "1234");
    }
}
