// `Vec<T>` обобщён по типу `T`. Чаще всего компилятор сам выводит `T`,
// например после добавления в вектор значения конкретного типа.
// Но в этом упражнении компилятору нужна помощь в виде аннотации типа.

fn main() {
    // TODO: Исправь ошибку компилятора, указав тип вектора
    // `Vec<T>`. Выбери в качестве `T` какой-нибудь целочисленный тип, в который
    // можно преобразовать `u8` и `i8`.
    let mut numbers = Vec::new();

    // Строки ниже не меняй.
    let n1: u8 = 42;
    numbers.push(n1.into());
    let n2: i8 = -1;
    numbers.push(n2.into());

    println!("{numbers:?}");
}
