fn main() {
    // Здесь можно по желанию поэкспериментировать.
}

#[cfg(test)]
mod tests {
    #[test]
    fn slice_out_of_array() {
        let a = [1, 2, 3, 4, 5];
        //       0  1  2  3  4  <- индексы
        //          -------
        //             |
        //             +--- срез

        // Обрати внимание: верхний индекс 4 не включается.
        let nice_slice = &a[1..4];
        assert_eq!([2, 3, 4], nice_slice);

        // Верхний индекс можно включить, используя синтаксис `..=` (со знаком `=`)
        let nice_slice = &a[1..=3];
        assert_eq!([2, 3, 4], nice_slice);
    }
}
