// Тесты важны, чтобы убедиться, что код делает именно то,
// что ты от него ждёшь.

fn is_even(n: i64) -> bool {
    n % 2 == 0
}

fn main() {
    // Здесь можно поэкспериментировать.
}

#[cfg(test)]
mod tests {
    // При написании модульных тестов принято импортировать всё из внешнего
    // модуля (`super`) с помощью подстановки.
    use super::*;

    #[test]
    fn you_can_assert() {
        assert!(is_even(0));
        assert!(!is_even(-1));
        //      ^ Проверить `false` можно оператором отрицания `!`.
    }
}
