// `Vec<T>` обобщён по типу `T`. Чаще всего компилятор сам выводит `T`,
// например после добавления в вектор значения конкретного типа.
// Но в этом упражнении компилятору нужна помощь в виде аннотации типа.

fn main() {
    // `u8` и `i8` можно преобразовать в `i16`.
    let mut numbers: Vec<i16> = Vec::new();
    //             ^^^^^^^^^^ добавлено

    // Строки ниже не меняй.
    let n1: u8 = 42;
    numbers.push(n1.into());
    let n2: i8 = -1;
    numbers.push(n2.into());

    println!("{numbers:?}");
}
