// Ключевое слово `use` позволяет подключать в область видимости пути к модулям
// откуда угодно, и особенно из стандартной библиотеки.

// TODO: Подключи `SystemTime` и `UNIX_EPOCH` из модуля `std::time` в
// свою область видимости. Бонусные баллы за стиль, если уложишься в одну строку!
// use ???;

fn main() {
    match SystemTime::now().duration_since(UNIX_EPOCH) {
        Ok(n) => println!("1970-01-01 00:00:00 UTC был {} секунд назад!", n.as_secs()),
        Err(_) => panic!("SystemTime раньше UNIX EPOCH!"),
    }
}
